# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'

# Binaries
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'hub'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'poetry'
brew 'pyenv'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'php'
# brew 'php@7.3'
# brew 'php@7.2'
brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
brew 'node'
# brew 'redis'
# brew 'yarn'

# Apps
cask 'alfred'
cask 'barrier'
cask 'brave-browser'
cask 'discord'
cask 'dropbox'
cask 'elgato-thunderbolt-dock'
cask 'fantastical'
cask 'firefox'
cask 'gitkraken'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'java'
cask 'keybase'
cask 'lastpass'
cask 'logitech-options'
cask 'notion'
cask 'nordvpn'
cask 'rectangle'
cask 'tableplus'
cask 'the-unarchiver'
cask 'turbo-boost-switcher'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-roboto-condensed'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

mas "Amphetamine", id: 937984704
mas "Sequel Ace", id: 1518036000
