# Taps
tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'

# Binaries
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
# brew 'php'
# brew 'php@7.3'
# brew 'php@7.2'
# brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
brew 'node'
# brew 'redis'
# brew 'yarn'

# Apps
cask 'alfred'
cask 'barrier'
cask 'bartender'
cask 'brave-browser'
cask 'discord'
cask 'dropbox'
cask 'elgato-thunderbolt-dock'
cask 'fantastical'
cask 'firefox'
cask 'folding-at-home'
cask 'github'
cask 'gitkraken'
cask 'google-backup-and-sync'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'keybase'
cask 'lastpass'
cask 'logitech-options'
cask 'nordvpn'
cask 'nvidia-geforce-now'
cask 'parallels'
cask 'rectangle'
cask 'steam'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-roboto-condensed'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
