# Taps
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php' # For the rare moments I need PHP 5.6

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'tree' # List directories in a tree structure

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'php'
brew 'php@7.4'
brew 'redis'
brew 'yarn'

# Apps
cask '1password-cli'
cask '1password'
cask 'adguard'
cask 'alfred'
cask 'anydesk'
cask 'barrier'
cask 'brave-browser'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'elgato-thunderbolt-dock'
cask 'fantastical'
cask 'figma'
cask 'firefox'
cask 'gitkraken'
cask 'google-drive'
cask 'gpg-suite'
cask 'imageoptim'
cask 'intel-power-gadget'
cask 'iterm2'
cask 'keepassxc'
cask 'keybase'
cask 'logitech-options'
cask 'nordvpn'
cask 'notion'
cask 'obsidian'
cask 'phpmon'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'PiPer', id: 1421915518